I am not able to get it to work with the following versions:
Terraform v1.0.10
ciscodevnet/mso v0.3.2
Nexus Dashboard v2.1(1d)
NDO v3.5.1e

When I run Terraform apply it immediately finishes, says it added 1 resource, but nothing is created in NDO.

Here's the plan:
`terraform {
  required_providers {
    mso = {
      source  = "CiscoDevNet/mso"
      version = "0.3.2"
    }
  }
}

variable "apic_user" {
  type        = string
}
variable "apic_pwd" {
  type        = string
}
variable "nd_ip" {
  type        = string
}
variable "nd_user" {
  type        = string
}
variable "nd_pwd" {
  type        = string
}

provider "mso" {
  username = var.nd_user
  password = var.nd_pwd
  url      = "https://${var.nd_ip}"
  insecure = true
}

resource "mso_site" "Kerrville" {
  name         = "Kerrville"
  username     = var.apic_user}
  password     = var.apic_pwd
  apic_site_id = 1
  urls         = ["https://192.168.253.17"]
}`

Here's the output:
`
Terraform will perform the following actions:

  # mso_site.Kerrville will be created
  + resource "mso_site" "Kerrville" {
      + apic_site_id     = "1"
      + cloud_providers  = (known after apply)
      + id               = (known after apply)
      + labels           = (known after apply)
      + login_domain     = (known after apply)
      + maintenance_mode = false
      + name             = "Kerrville"
      + password         = "password"
      + platform         = (known after apply)
      + urls             = [
          + "https://192.168.253.17",
        ]
      + username         = "admin"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

mso_site.Kerrville: Creating...
mso_site.Kerrville: Creation complete after 1s [id={}]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
`